khoih-prog/ESP8266_AT_WebServer/src/Parsing-impl.h
    method = HTTP_DELETE;
  }
  else if (methodStr == "OPTIONS")
  {
    method = HTTP_OPTIONS;
  }
  else if (methodStr == "PUT")
  {
    method = HTTP_PUT;
  }
  else if (methodStr == "PATCH")
  {
    method = HTTP_PATCH;
  }
#endif

  _currentMethod = method;


  AT_LOGDEBUG1(F("method: "), methodStr);
  AT_LOGDEBUG1(F("url: "), url);
  AT_LOGDEBUG1(F("search: "), searchStr);

  //attach handler
  RequestHandler* handler;

  for (handler = _firstHandler; handler; handler = handler->next())
  {
    if (handler->canHandle(_currentMethod, _currentUri))
      break;
  }

  _currentHandler = handler;

  String formData;

  // below is needed only when POST type request
  if (method == HTTP_POST || method == HTTP_PUT || method == HTTP_PATCH || method == HTTP_DELETE)
  {
    String boundaryStr;
    String headerName;
    String headerValue;
    
    bool isForm             = false;
    bool isEncoded          = false;
    uint32_t contentLength  = 0;

    //parse headers
    while (1)
    {
      req = client.readStringUntil('\r');
      client.readStringUntil('\n');

      if (req == "")
      {
        AT_LOGDEBUG(F("POST_PUT_PATCH_DELETE: No more header"));
        
        break;//no more headers
      }  

      int headerDiv = req.indexOf(':');

      if (headerDiv == -1)
      {
        AT_LOGDEBUG(F("headerDiv = -1"));
        
        break;
      }

      headerName  = req.substring(0, headerDiv);
      headerValue = req.substring(headerDiv + 1);
      
      headerValue.trim();
      _collectHeader(headerName.c_str(), headerValue.c_str());

      AT_LOGDEBUG1(F("headerName: "), headerName);
      AT_LOGDEBUG1(F("headerValue: "), headerValue);

      //KH
      if (headerName.equalsIgnoreCase("Content-Type"))
      {
        using namespace mime;
        
        if (headerValue.startsWith(mimeTable[txt].mimeType))
        {
          isForm = false;
        }
        else if (headerValue.startsWith("application/x-www-form-urlencoded"))
        {
          isForm = false;
          isEncoded = true;
        }
        else if (headerValue.startsWith("multipart/"))
        {
          boundaryStr = headerValue.substring(headerValue.indexOf('=') + 1);
          // KH
          boundaryStr.replace("\"", "");
          //
          isForm = true;
        }
      }
      //KH
      else if (headerName.equalsIgnoreCase("Content-Length"))
      {
        contentLength = headerValue.toInt();
      }
      //KH
      else if (headerName.equalsIgnoreCase("Host"))
      {
        _hostHeader = headerValue;
      }
    }

    //KH
#if USE_NEW_WEBSERVER_VERSION
    String plainBuf;

    if (   !isForm
           && // read content into plainBuf
           (   !readBytesWithTimeout(client, contentLength, plainBuf, HTTP_MAX_POST_WAIT)
               || (plainBuf.length() < contentLength)
           )
       )
    {
      return false;
    }

    if (isEncoded)
    {
      // isEncoded => !isForm => plainBuf is not empty
      // add plainBuf in search str
      if (searchStr.length())
        searchStr += '&';

      searchStr += plainBuf;
    }

    // parse searchStr for key/value pairs
    _parseArguments(searchStr);

    if (!isForm)
    {
      if (contentLength)
      {
        // add key=value: plain={body} (post json or other data)
        RequestArgument& arg = _currentArgs[_currentArgCount++];
        arg.key = F("plain");
        arg.value = plainBuf;
      }
    }
    else
    {
      // isForm is true
      // here: content is not yet read (plainBuf is still empty)
      if (!_parseForm(client, boundaryStr, contentLength))
      {
        return false;
      }
    }
  }
  else
  {
    String headerName;
    String headerValue;

    //parse headers
    while (1)
    {
      AT_LOGDEBUG(F("GET_HEAD_OPTIONS: while start"));
      
      //req = client.readStringUntil('\r');
      //client.readStringUntil('\n');
      req = client.readStringUntil(0x0D);
      
      AT_LOGDEBUG1(F("GET_HEAD_OPTIONS: req ="), req);
      
      client.readStringUntil(0x0A);

      if (req == "")
      {
        AT_LOGDEBUG(F("GET_HEAD_OPTIONS: No more header"));
        
        break;//no more headers
      }  

      int headerDiv = req.indexOf(':');

      if (headerDiv == -1)
      {
        AT_LOGDEBUG(F("headerDiv = -1"));
        
        break;
      }

      headerName  = req.substring(0, headerDiv);
      headerValue = req.substring(headerDiv + 2);
      _collectHeader(headerName.c_str(), headerValue.c_str());

      AT_LOGDEBUG1(F("headerName:"), headerName);
      AT_LOGDEBUG1(F("headerValue:"), headerValue);

      if (headerName.equalsIgnoreCase(F("Host")))
      {
        _hostHeader = headerValue;
      }
    }

    _parseArguments(searchStr);
    
    AT_LOGDEBUG(F("GET_HEAD_OPTIONS: while end"));
  }

  client.flush();

  AT_LOGDEBUG1(F("Request:"), url);
  AT_LOGDEBUG1(F("Arguments:"), searchStr);
  AT_LOGDEBUG (F("Final list of key/value pairs:"));

  for (int i = 0; i < _currentArgCount; i++)
  {
    AT_LOGDEBUG1("key:",   _currentArgs[i].key.c_str());
    AT_LOGDEBUG1("value:", _currentArgs[i].value.c_str());
  }

  return true;

#else

    if (isForm)
    {
      _parseArguments(searchStr);

      if (!_parseForm(client, boundaryStr, contentLength))
      {
        return false;
      }
    }
  }
  else
  {
    String headerName;
    String headerValue;

    //parse headers
    while (1)
    {
      req = client.readStringUntil('\r');
      client.readStringUntil('\n');

      if (req == "")
      {
        AT_LOGDEBUG(F("No more header"));
        
        break;//no more headers
      }  

      int headerDiv = req.indexOf(':');

      if (headerDiv == -1)
      {
        AT_LOGDEBUG(F("headerDiv = -1"));
        
        break;
      }

      headerName  = req.substring(0, headerDiv);
      headerValue = req.substring(headerDiv + 2);
      _collectHeader(headerName.c_str(), headerValue.c_str());

      AT_LOGDEBUG1(F("headerName: "), headerName);
      AT_LOGDEBUG1(F("headerValue: "), headerValue);

      if (headerName == "Host")
      {
        _hostHeader = headerValue;
      }
    }

    _parseArguments(searchStr);
  }

  client.flush();

  AT_LOGDEBUG1(F("Request: "), url);
  AT_LOGDEBUG1(F("Arguments: "), searchStr);

