khoih-prog/ESP8266_AT_WebServer/src/Parsing-impl.h
  return true;

#endif
}

bool ESP8266_AT_WebServer::_collectHeader(const char* headerName, const char* headerValue)
{
  for (int i = 0; i < _headerKeysCount; i++)
  {
    //KH
    if (_currentHeaders[i].key.equalsIgnoreCase(headerName))
    {
      _currentHeaders[i].value = headerValue;
      return true;
    }
  }

  return false;
}


#if USE_NEW_WEBSERVER_VERSION

struct storeArgHandler
{
  void operator() (String& key, String& value, const String& data, int equal_index, int pos, int key_end_pos, int next_index)
  {
    key = ESP8266_AT_WebServer::urlDecode(data.substring(pos, key_end_pos));
    
    if ((equal_index != -1) && ((equal_index < next_index - 1) || (next_index == -1)))
      value = ESP8266_AT_WebServer::urlDecode(data.substring(equal_index + 1, next_index));
  }
};

struct nullArgHandler
{
  void operator() (String& key, String& value, const String& data, int equal_index, int pos, int key_end_pos, int next_index) 
  {
    (void)key; (void)value; (void)data; (void)equal_index; (void)pos; (void)key_end_pos; (void)next_index;
    // do nothing
  }
};

void ESP8266_AT_WebServer::_parseArguments(const String& data) 
{
  if (_currentArgs)
    delete[] _currentArgs;

  _currentArgCount = _parseArgumentsPrivate(data, nullArgHandler());

  // allocate one more, this is needed because {"plain": plainBuf} is always added
  _currentArgs = new RequestArgument[_currentArgCount + 1];

  (void)_parseArgumentsPrivate(data, storeArgHandler());
}

int ESP8266_AT_WebServer::_parseArgumentsPrivate(const String& data, vl::Func<void(String&,String&,const String&,int,int,int,int)> handler) 
{

  AT_LOGDEBUG1(F("args: "), data);

  size_t pos = 0;
  int arg_total = 0;

  while (true) 
  {
    // skip empty expression
    while (data[pos] == '&' || data[pos] == ';')
      if (++pos >= data.length())
        break;

    // locate separators
    int equal_index = data.indexOf('=', pos);
    int key_end_pos = equal_index;
    int next_index  = data.indexOf('&', pos);
    int next_index2 = data.indexOf(';', pos);
    
    if ((next_index == -1) || (next_index2 != -1 && next_index2 < next_index))
      next_index = next_index2;
      
    if ((key_end_pos == -1) || ((key_end_pos > next_index) && (next_index != -1)))
      key_end_pos = next_index;
      
    if (key_end_pos == -1)
      key_end_pos = data.length();

    // handle key/value
    if ((int)pos < key_end_pos) 
    {
      RequestArgument& arg = _currentArgs[arg_total];
      handler(arg.key, arg.value, data, equal_index, pos, key_end_pos, next_index);

      ++arg_total;
      pos = next_index + 1;
    }

    if (next_index == -1)
      break;
  }

  AT_LOGDEBUG1(F("args count: "), arg_total);

  return arg_total;
}

void ESP8266_AT_WebServer::_uploadWriteByte(uint8_t b)
{
  if (_currentUpload->currentSize == HTTP_UPLOAD_BUFLEN)
  {
    if(_currentHandler && _currentHandler->canUpload(_currentUri))
      _currentHandler->upload(*this, _currentUri, *_currentUpload);
      
    _currentUpload->totalSize += _currentUpload->currentSize;
    _currentUpload->currentSize = 0;
  }
  
  _currentUpload->buf[_currentUpload->currentSize++] = b;
}

uint8_t ESP8266_AT_WebServer::_uploadReadByte(ESP8266_AT_Client& client)
{
  int res = client.read();
  
  if (res == -1)
  {
    while(!client.available() && client.connected())
      yield();
      
    res = client.read();
  }
  
  return (uint8_t)res;
}

#else

void ESP8266_AT_WebServer::_parseArguments(String data) 
{

  AT_LOGDEBUG1(F("args: "), data);

  if (_currentArgs)
    delete[] _currentArgs;

  _currentArgs = 0;

  if (data.length() == 0)
  {
    _currentArgCount = 0;
    _currentArgs = new RequestArgument[1];

    return;
  }

  _currentArgCount = 1;

  for (int i = 0; i < (int)data.length(); )
  {
    i = data.indexOf('&', i);

    if (i == -1)
      break;

    ++i;
    ++_currentArgCount;
  }

  AT_LOGDEBUG1(F("args count: "), _currentArgCount);

  _currentArgs = new RequestArgument[_currentArgCount + 1];
  
  int pos = 0;
  int iarg;
  
  for (iarg = 0; iarg < _currentArgCount;) 
  {
    int equal_sign_index  = data.indexOf('=', pos);
    int next_arg_index    = data.indexOf('&', pos);

    AT_LOGDEBUG1(F("pos: "), pos);
    AT_LOGDEBUG1(F("=@ "), equal_sign_index);
    AT_LOGDEBUG1(F(" &@ "), next_arg_index);

    if ((equal_sign_index == -1) || ((equal_sign_index > next_arg_index) && (next_arg_index != -1))) 
    {
      AT_LOGDEBUG1(F("arg missing value: "), iarg);

      if (next_arg_index == -1)
        break;
        
      pos = next_arg_index + 1;
      
      continue;
    }
    
    RequestArgument& arg = _currentArgs[iarg];
    arg.key   = data.substring(pos, equal_sign_index);
    arg.value = data.substring(equal_sign_index + 1, next_arg_index);

    AT_LOGDEBUG1(F("arg: "), iarg);
    AT_LOGDEBUG1(F("key: "), arg.key);
    AT_LOGDEBUG1(F("value: "), arg.value);

    ++iarg;
    
    if (next_arg_index == -1)
      break;
      
    pos = next_arg_index + 1;
  }
  
  _currentArgCount = iarg;

  AT_LOGDEBUG1(F("args count: "), _currentArgCount);
}

void ESP8266_AT_WebServer::_uploadWriteByte(uint8_t b) 
{
  if (_currentUpload.currentSize == HTTP_UPLOAD_BUFLEN) 
  {
    if (_currentHandler && _currentHandler->canUpload(_currentUri))
      _currentHandler->upload(*this, _currentUri, _currentUpload);
      
    _currentUpload.totalSize += _currentUpload.currentSize;
    _currentUpload.currentSize = 0;
  }
  
  _currentUpload.buf[_currentUpload.currentSize++] = b;
}

uint8_t ESP8266_AT_WebServer::_uploadReadByte(ESP8266_AT_Client& client) 
{
  int res = client.read();

  if (res == -1)
  {
    while (!client.available() && client.connected())
      yield();

    res = client.read();
  }

  return (uint8_t)res;
}

#endif

#if USE_NEW_WEBSERVER_VERSION

bool ESP8266_AT_WebServer::_parseForm(ESP8266_AT_Client& client, const String& boundary, uint32_t len)
{
  (void) len;

  AT_LOGDEBUG1(F("Parse Form: Boundary: "), boundary);
  AT_LOGDEBUG1(F("Length: "), len);

  String line;
  int retry = 0;
  
  do 
  {
    line = client.readStringUntil('\r');
    ++retry;
  } while (line.length() == 0 && retry < 3);

  client.readStringUntil('\n');
  
  //start reading the form
  if (line == ("--" + boundary)) 
  {
    if (_postArgs)
      delete[] _postArgs;

    _postArgs = new RequestArgument[WEBSERVER_MAX_POST_ARGS];
    _postArgsLen = 0;

    while (1)
    {
      String argName;
      String argValue;
      String argType;
      String argFilename;
      
      bool argIsFile = false;

